#include <iostream>
#include "function.h"
using namespace std;

void menu()
{
	cout << endl;
	cout << endl << "ВОЗМОЖНЫЕ ДЕЙСТВИЯ:" << endl;;
	cout << endl << "1 - Вывести все параметры призмы";
	cout << endl << "2 - Вывести число сторон призмы";
	cout << endl << "3 - Вывести длинну сторон призмы";
	cout << endl << "4 - Вывести высоту призмы";
	cout << endl << "5 - Вывести площадь основания призмы";
	cout << endl << "6 - Вывести объем призмы";
	cout << endl << "7 - Задать число сторон призмы";
	cout << endl << "8 - Задать длинну сторон призмы";
	cout << endl << "9 - Задать высоту призмы";
	cout << endl << "10 - Задать площадь основания призмы";
	cout << endl << "0 - выйти из программы";
	cout << endl;
	cout << endl << "Выберете действие:";
}