#include <iomanip>
#include <iostream>
#include "prism.h"
using namespace std;
//------------------------ TASK --------------------------------------------------
/*
Описать класс призма : объём, высота, количество граней, длинна сторон, площадь основания.
Реализовать get - и set - методы для работы с элемент - данными класса.
Организовать выбор(меню) входные и выходные данные. Защитить элемент - данные призмы от внешних кодов.
V = S * h;

*/
//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	











	system("pause");
	return 0;
}
